{
    "ShowNav": "Show navigation",
    "HideNav": "Hide navigation",
    "Home": "Home",
    "About": "About",
    "Resume": "Resume",
    "Projects": "Portfolio",
    "Contact": "Contact",
    "Name": "Pablo Suarez",
    "HeaderDesc1": "I'm a ",
    "Occupation": "Systems and Computational Engineer",
    "HeaderDesc2": " from ",
    "City": "Bogota",
    "HeaderDesc3": "Passionate about Game Development and Web Technologies.",

    "Bio": "Hi! My name is Pablo Suarez, I'm 24 years-old, and right now I'm working as a Backend Unity Developer at BW Studios. I have experience in web development with Frontend frameworks such as Angular and Backend tech like Node, and game development in Unity. I'm also currently getting certified in Unreal Engine 5, completing a diploma for Videogame Development, and working on some videogame projects that are available now on the Google Play Store and Steam!",
    "Address": "Calle 127D #19-93",
    "State": "D.C.",
    "Zip": "110121",
    "DownloadCV": "Download Resume",

    "Education": "Education",
    "Work": "Work",
    "Skills": "Skills",
    "SkillMsg": "In general, I shine the most when it comes to solving complex engineering and programming challenges. I can confidently describe myself as a fast-learner, a team-player, always hungry for knowledge, and always willing and eager to help others whenever and however I can. In terms of technologies I've worked with, these are the most relevant to the career I'm pursuing and my own experience working in games and web:",

    "ProjectsMsg": "Some of my previous projects",

    "ContactMsg": "Contact me! I'm always open to offers, questions, comments, etc. You can use this form to send me an email or contact me directly through any of the links in this website's footer or in the header below my name.",
    "FormName": "Name ",
    "FormSubject": "Subject",
    "FormMsg": "Message ",
    "FormSend": "Send",
    "FormSuccess": "Your message has been sent. Thank you!",
    "ContactInfoMsg": "Address, email, and phone number"
}