{
  "ShowNav": "Mostrar navegación",
  "HideNav": "Ocultar navegación",
  "Home": "Inicio",
  "About": "Sobre mí",
  "Resume": "Resume",
  "Projects": "Proyectos",
  "Contact": "Contacto",
  "Name": "Pablo Suárez",
  "HeaderDesc1": "Soy un ",
  "Occupation": "Ingeniero de Sistemas y Computación",
  "HeaderDesc2": " de ",
  "City": "Bogotá",
  "HeaderDesc3": "Apasionado por el desarrollo de videojuegos y la programación web.",
  "Bio": "¡Hola! Me llamo Pablo Suárez y actualmente estoy trabajando como Ingeniero de Software en Endless Adventures Inc. Tengo amplia experiencia en desarrollo de videojuegos en Unity (4 años y contando), y en programación web Frontend con Angular y Backend con Node. Además, estoy certificándome en Unreal Engine 5, completando una especialización en Desarrollo de Videojuegos, y trabajando en videojuegos hechos por mí en mi tiempo libre, varios de los cuales ya se encuentran disponibles en la Play Store de Google y en Steam.",
  "Address": "Calle 127D #19-93",
  "State": "D.C.",
  "Zip": "110121",
  "DownloadCV": "Descargar resume",
  "Education": "Educación",
  "Work": "Laboral",
  "Skills": "Habilidades",
  "SkillMsg": "Mi fuerte es la resolución de problemas y desafíos complejos de ingeniería y programación. Me describo como una persona que aprende rápido, orientado al trabajo en equipo, siempre con hambre de nuevos retos y nuevo conocimiento, y siempre dispuesto a prestar ayuda de cualquier forma que pueda. Sobre las tecnologías que manejo, las siguientes son las más relevantes para el camino de carrera que estoy construyendo y sobre la experiencia que he acumulado hasta el momento:",
  "ProjectsMsg": "Algunos de mis proyectos",
  "ContactMsg": "¡Contáctame! Todos mis canales están abiertos a preguntas, ofertas, comentarios, etc. Puedes usar este formulario para enviarme un correo electrónico o escribirme por cualquiera de los enlaces que están al final de la página o al principio debajo de mi nombre.",
  "FormName": "Nombre ",
  "FormSubject": "Asunto",
  "FormMsg": "Mensaje ",
  "FormSend": "Enviar",
  "FormSuccess": "Se envió el mensaje. ¡Gracias!",
  "ContactInfoMsg": "Dirección, correo, y teléfono"
}