{
  "main": {
    "name":"Pablo Suárez",
    "occupation":"Ingeniero de Sistemas y Computación",
    "description":"Apasionado por el desarrollo de videojuegos, y por el diseño y desarrollo de software",
    "image":"profilepic.jpg",
    "bio":"¡Hola! Me llamo Pablo Suárez, tengo 22 años, y actualmente estoy en mi noveno semestre de Ingeniería de Sistemas y Computación en la Universidad de los Andes. Mi fuerte, mi interés, y mi pasión es el diseño y desarollo de software; aunque el desarrollo en back end se me da mejor que en el front end, ambos me interesan profundamente. Además, me encanta el desarrollo de videojuegos, y espero algún día alinear mi carrera con este aspecto de mí.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "pabloasuarezm@hotmail.com\npabloasuarezm@gmail.com",
    "phone": "(+57) 300-880-1016",
    "address":{
      "street":"Calle 127D #19-93",
      "city":"Bogotá",
      "state":"D.C.",
      "zip": "110121"
    },
    "website": "https://pa-suarezm.github.io",
    "resumedownload":"https://1drv.ms/u/s!Aimq6oYEzi1iq1RxVhtWrIKuo4lM?e=IwIYnF"
  },
  "resume":{
    "skillmessage":"En general, se me da bien la parte de desarrollo de software. Además, a pesar de que el diseño no es mi fuerte, siempre puedo aportar ideas y feedback a los procesos de diseño de UI/UX",
    "education":[
      {
        "school":"Universidad de los Andes - Carrera",
        "degree":"Ingeniería de Sistemas y Computación",
        "graduated":"Octubre 2021",
        "description":"Ha sido la mejor experiencia de mi vida. Aparte de conocimiento técnico y teórico en sistemas y computación, he aprendido a relacionarme mejor con mis compañeros de trabajo, así como mejorar mis habilidades de comunicación oral y escrita tanto en español como en inglés."
      },
      {
        "school":"Universidad de los Andes - Certificado",
        "degree":"Desarrollo de videojuegos en Unity",
        "graduated":"Julio 2020",
        "description":"Este fue mi primer acercamiento a Unity como herramienta de creación de videojuegos. Este curso facilitó el desarrollo de mi proyecto de grado (ver la sección de Proyectos) y profundizó mi interés en el desarrollo de videojuegos."
      }
    ],
    "work":[
      {
        "company":"Universidad de los Andes",
        "title":"Monitor",
        "years":"Semestres 2017-2, 2018-1, 2020-1, 2020-2",
        "description":"Asistí a los profesores Christian Aparicio (2017 y 2018) y Carlos Navarrete (2020-1) en un curso de programación orientada por objetos (dictado en Java) calificando exámenes parciales, ejercicios y ayudando a alrededor de 25 estudiantes a resolver dudas y problemas durante las sesiones prácticas. Además, asistí a los profesores Mario Linares y Anamaría Mojica (2020-2) en un curso de desarrollo de aplicaciones móviles (donde brindé apoyo en la programación en Kotlin para Android) calificando entregas y ayudando a alrededor de 70 estudiantes a resolver dudas y problemas durante mis horarios de atención."  
      },
      {
        "company": "Universidad de los Andes",
        "title": "Tutor de álgebra y cálculo",
        "years": "Semestres 2018-2, 2019-1, 2019-2",
        "description": "Asistí a estudiantes con dudas y problemas sobre cálculo diferencial, integral y vectorial, y álgebra lineal en el centro de apoyo de ciencias de la universidad durante sesiones que podían ser personales, grupales (de hasta 5 estudiantes), o como una clase completa de 30 a 40 estudiantes."
      },
      {
        "company": "Universidad de los Andes",
        "title": "Tutor de programación",
        "years": "Semestre 2019-1",
        "description": "Asistí a estudiantes con dudas y problemas sobre programación orientada a objetos en Java y cómo plantear algoritmos suficientes y eficientes que resuelvan dichos problemas durante sesiones personales de 30 minutos a una hora."
      }
    ],
    "skills":[
      {
        "name":"Java",
        "level":"85%"
      },
      {
        "name":"HTML/CSS, Bootstrap, ReactJs",
        "level":"80%"
      },
      {
        "name":"Git",
        "level":"60%"
      },
      {
        "name":"Unity/C#",
        "level":"60%"
      },
      {
        "name":"Kotlin",
        "level":"65%"
      },
      {
        "name":"Python",
        "level":"55%"
      },
      {
        "name":"PostgreSQL, MongoDB",
        "level":"70%"
      },
      {
        "name": "UI",
        "level": "30%"
      },
      {
        "name": "UX",
        "level": "45%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
