{
  "main": {
    "image":"profilepic.jpg",
    "email": "pabloasuarezm@hotmail.com\npabloasuarezm@gmail.com",
    "phone": "(+57) 300-880-1016",
    "website": "https://pa-suarezm.github.io",
    "resumedownload":"https://1drv.ms/u/s!Aimq6oYEzi1iq1RxVhtWrIKuo4lM?e=IwIYnF"
  },
  "resume":{
    "educationEs":[
      {
        "school":"Universidad de los Andes - Pregrado",
        "degree":"Ingeniería de Sistemas y Computación",
        "graduated":"Octubre 2021",
        "description":"Fue la mejor experiencia de mi vida. Aparte de conocimiento técnico y teórico en sistemas y computación, aprendí a relacionarme mejor con mis compañeros de trabajo, así como a mejorar mis habilidades de comunicación oral y escrita tanto en español como en inglés."
      },
      {
        "school":"Universidad de los Andes - Certificado",
        "degree":"Desarrollo de videojuegos en Unity",
        "graduated":"Julio 2020",
        "description":"Este fue mi primer acercamiento a Unity como herramienta de creación de videojuegos. Este curso facilitó el desarrollo de mi proyecto de grado (ver la sección 'Proyectos') y profundizó mi interés en el desarrollo de videojuegos."
      },
      {
        "school": "Universidad de los Andes - Certificado",
        "degree": "Diseño de videojuegos",
        "graduated": "Julio 2022",
        "description": "En este curso aprendí los fundamentos del diseño de videojuegos y pude poner en práctica mis conocimientos planteando diseñós, documentándolos en documentos de diseño, y prototipándolos en Unity."
      },
      {
        "school":"Ada School - Certificado",
        "degree":"Pragmatic Technical Lead + React",
        "graduated":"Octubre 2021",
        "description":"Tomé este curso mientras trabajaba en Imagine Apps como Desarrollador Fullstack Junior con el fin de entrenarme para el siguiente cargo donde tuve responsabilidades de liderazgo de equipos y de liderazgo técnico como Desarrollador Fullstack Semisenior."
      }
    ],
    "educationEn":[
      {
        "school":"Universidad de los Andes - Undergraduate degree",
        "degree":"Systems and Computational Engineering",
        "graduated":"October 2021",
        "description":"This was the best experience of my life. Not only was I able to gather technical and theoretical knowledge and experience in systems and computation, but I also learned how to better work with my teammates and to improve my communication skills (both in writting and speaking) in Spanish and English."
      },
      {
        "school":"Universidad de los Andes - Certificate",
        "degree":"Videogame Development in Unity",
        "graduated":"July 2020",
        "description":"This course was my first experience using the Unity game engine. It was crucial to get my graduation project done (see the 'Projects' section) and further established Videogame Development as a passion for me."
      },
      {
        "school": "Universidad de los Andes - Certificate",
        "degree": "Videogame Design",
        "graduated": "July 2022",
        "description": "In this course I was able to learn the fundamentals of game design while applying this knowledge by designing my own games from scratch, documenting these designs in multiple GDD's, and prototyping them in Unity as a proof of concept."
      },
      {
        "school":"Ada School - Certificate",
        "degree":"Pragmatic Technical Lead + React",
        "graduated":"October 2021",
        "description":"I took this course while I was working at Imagine Apps as a Junior Fullstack Dev in order to prepare myself for my next role in the company (Ssr. Fullstack Dev) where I had responsabilities geared towards team and tech leadership."
      }
    ],
    "workEs":[
      {
        "company": "BW Studios",
        "title": "Desarrollador Backend Unity",
        "years": "Abril 2022 - actualidad",
        "description": "Actualmente trabajo en el equipo encargado de las integraciones y requerimientos para Papumba. En este rol, he tenido que desarrollar nuevas funciones cloud desplegadas en Firebase, integrarlas y desarrollarlas en la app de Papumba desde Unity, y comunicar a nuestros clientes en Papumba sobre nuestros avances y negociar cuáles deben ser las siguientes funcionalidades a desarrollar y su fecha de entrega."
      },
      {
        "company": "Imagine Apps",
        "title": "Desarrollador Fullstack Semisenior",
        "years": "Diciembre 2021 - Abril 2022",
        "description": "Desarrollé, probé, ajusté diseños, e iteré sobre el proyecto Feat. En este cargo tuve un rol importante de liderazgo en mi equipo de desarrollo el cual se venía cultivando desde mi anterior cargo como Desarrollador Jr. También asistí, aconsejé, y guié a compañeros nuevos en la empresa para que así se familiarizaran con los procesos internos de desarrollo así como con dudas más técnicas de sus propios proyectos."
      },
      {
        "company": "Imagine Apps",
        "title": "Desarrollador Fullstack Junior",
        "years": "Diciembre 2020 - Diciembre 2021",
        "description": "Diseñé, desarrollé, probé, e iteré sobre el proyecto Simulador de consultas en conjunto con el departamento de medicina de la Universidad de Los Andes; estuve a cargo del diseño del sistema y su desarrollo completo desde el primer día. Este proyecto tiene un alcance de más de 800 estudiantes de pregrado y 250 profesores del departamento de medicina. Asimismo, diseñé, desarrollé, probé, e iteré sobre el proyecto Feat; uno de los proyectos de mayor complejidad en Imagine Apps en el cual fui asignado como desarrollador principal."
      },
      {
        "company":"Universidad de los Andes",
        "title":"Monitor",
        "years":"Semestres 2017-2, 2018-1, 2020-1, 2020-2",
        "description":"Asistí a los profesores Christian Aparicio (2017 y 2018) y Carlos Navarrete (2020-1) en un curso de programación orientada por objetos (dictado en Java) calificando exámenes parciales, ejercicios y ayudando a alrededor de 25 estudiantes a resolver dudas y problemas durante las sesiones prácticas. Además, asistí a los profesores Mario Linares y Anamaría Mojica (2020-2) en un curso de desarrollo de aplicaciones móviles (donde brindé apoyo en la programación en Kotlin para Android) calificando entregas y ayudando a alrededor de 70 estudiantes a resolver dudas y problemas durante mis horarios de atención."  
      },
      {
        "company": "Universidad de los Andes",
        "title": "Tutor de álgebra y cálculo",
        "years": "Semestres 2018-2, 2019-1, 2019-2",
        "description": "Asistí a estudiantes con dudas y problemas sobre cálculo diferencial, integral y vectorial, y álgebra lineal en el centro de apoyo de ciencias de la universidad durante sesiones que podían ser personales, grupales (de hasta 5 estudiantes), o como una clase completa de 30 a 40 estudiantes."
      },
      {
        "company": "Universidad de los Andes",
        "title": "Tutor de programación",
        "years": "Semestre 2019-1",
        "description": "Asistí a estudiantes con dudas y problemas sobre programación orientada a objetos en Java y cómo plantear algoritmos suficientes y eficientes que resuelvan dichos problemas durante sesiones personales de 30 minutos a una hora."
      }
    ],
    "workEn":[
      {
        "company": "BW Studios",
        "title": "Backend Unity Developer",
        "years": "April 2022 (current role)",
        "description": "I'm currently working on a team dedicated to integrating new functionalities for Papumba. In this role, I've had to create new cloud functions and deploy them on Firebase, and also integrate and develop them within the app itself in Unity. I've also had to constantly communicate with our clients to chat about our progress and to reach a consensus regarding what functionalities will be done next."
      },
      {
        "company": "Imagine Apps",
        "title": "Ssr. Fullstack Developer",
        "years": "December 2021 - April 2022",
        "description": "Developed, tested, adjusted designs, and iterated over the Feat project. As a semi-senior dev. I had an important role as a leader within my development team. I also had a mentorship role in which I assisted, advised, and overall guided new coworkers to help them get familiar and comfortable in the company and with our development processes. Finally, this role had me supporting my coworkers with more technical aspects of their own projects by helping them understand what’s expected of them and how to best approach their tasks."
      },
      {
        "company": "Imagine Apps",
        "title": "Jr. Fullstack Developer",
        "years": "December 2020 - December 2021",
        "description": "Designed, developed, tested, and iterated over the Consultation Simulator project in conjunction with the University of the Andes’ Med School. I was in charge of the system’s design and its full development from day 1. This project has a reach of over 800 undergraduate students and 250 professors. Moreover, I designed, developed, tested, and iterated on the Feat project as lead developer; one of the biggest and most complex projects within Imagine Apps."
      },
      {
        "company":"Universidad de los Andes",
        "title":"Teaching Assistant",
        "years":"Semesters 2017-2, 2018-1, 2020-1, 2020-2",
        "description":"Assisted professors Christian Aparacio (2017 and 2018) and Carlos Navarrete (2020-1) in an Object-Oriented Programming course (in Java) by grading midterms and projects, and helping more or less 25 students (per semester) by answering their questions during practical sessions. I also assited professors Mario Linares and Anamaria Mojica (2020-2) in a Mobile App Development course (particularly with Kotlin programming for Android) by grading deliverables and exams, and helping nearly 70 students by answering their questions during my weekly office hours."
      },
      {
        "company": "Universidad de los Andes",
        "title": "Algebra and Calculus Tutor",
        "years": "Semesters 2018-2, 2019-1, 2019-2",
        "description": "Assisted students with questions and problems regarding differential, integral and vector calculus and linear algebra in the university’s science help center during one-on-one sessions, group sessions of around 4 students, or a whole class of 30 to 40 students."
      },
      {
        "company": "Universidad de los Andes",
        "title": "Programming Tutor",
        "years": "Semester 2019-1",
        "description": "Assisted students with questions and problems regarding object-oriented programming in Java and how to design complete and efficient algorithms to solve them during one-on-one sessions ranging from 30 minutes to an hour."
      }
    ],
    "skills":[
      {
        "name":"Unity/C#",
        "level":"80%"
      },
      {
        "name":"Unreal/Blueprint/C++",
        "level":"25%"
      },
      {
        "name": "GameMaker Studio 2",
        "level":"30%"
      },
      {
        "name":"Git",
        "level":"85%"
      },
      {
        "name":"HTML/CSS, Bootstrap",
        "level":"90%"
      },
      {
        "name":"AngularJS",
        "level":"85%"
      },
      {
        "name": "ReactJS",
        "level": "65%"
      },
      {
        "name": "TypeScript/JavaScript",
        "level": "80%"
      },
      {
        "name":"Firebase, AWS, Heroku",
        "level":"75%"
      },
      {
        "name": "UI/UX",
        "level": "50%"
        
      }
    ]
  },
  "portfolio":{
    "projectsEs": [
      {
        "title": "BuffZ and NerfZ",
        "category": "Twin-stick arcade zombie shooter hecho en Unity, pronto disponible en Steam y la Google Play Store. Cada pocos segundos el juegador o sus enemigos son fortalecidos o debilitados.",
        "image": "buffz-and-nerfz.png",
        "url": "https://pa-suarezm.itch.io/buffz-and-nerfz"
      },
      {
        "title": "Asteroids",
        "category": "Juego hipercasual de arcade hecho en Unity. ¡Ya disponible en la Google Play Store! El jugador controla la nave inclinando el teléfono y tocando la pantalla para disparar.",
        "image": "asteroids.png",
        "url": "https://play.google.com/store/apps/details?id=com.pulguita_games.asteroids"
      },
      {
        "title": "Papumba",
        "category": "App para iOS y Android hecha en Unity donde niños de 2 a 7 años gozan de juegos, libros, videos, y demás recursos que les permitan desarrollarse y aprender.",
        "image": "papumba.png",
        "url": "https://www.papumba.com/"
      },
      {
        "title": "Feat",
        "category": "Web que conecta establecimientos con distribuidores, y distribuidores con organizaciones de marcas y permite a las organizaciones realizar pedidos y gestionar su personal.",
        "image": "feat.png",
        "url": "https://www.instagram.com/feat.b4b/"
      },
      {
        "title":"Simulador de consultas",
        "category":"Videojuego serio para que estudiantes de medicina practiquen consultas con pacientes virtuales programados por sus profesores.",
        "image": "simulador-de-consultas.png",
        "url": "https://youtu.be/3C3CkQcVXH0"
      },
      {
        "title":"Boom Away",
        "category":"Proyecto de grado. Hicimos un videojuego en Unity aplicando técnicas de desarrollo ágil de software.",
        "image":"boom-away.png",
        "url":"https://boomawayinc.itch.io/"
      },
      {
        "title":"Easy Demographics",
        "category":"Proyecto de mitad carrera. Usamos AI para dar estadísticas sobre las personas visibles en un video dado.",
        "image":"easy-demographics.png",
        "url":"https://github.com/AfLosada/EasyDemographics"
      },
      {
        "title": "LUCI",
        "category": "Aplicación nativa de Android conectada a Firebase hecha para apoyar el registro y distribución de domicilios de los vendedores de la plaza de verduras de Codabas.",
        "image": "luci.png",
        "url": "https://gitlab.com/ISIS3510_202010_Team19/android-kotlin"
      },
      {
        "title":"Limbs",
        "category":"El primer videojuego que desarrollé. Fue mi respuesta al GMTK Game Jam 2019 con un tiempo de desarrollo de menos de 48 horas.",
        "image":"limbs.png",
        "url":"https://pa-suarezm.itch.io/limbs"
      },
      {
        "title":"Personal Website",
        "category":"Página web personal hecha en React. Tomé la plantilla creada por Tim Baker y ajusté el código a mi gusto sin comprometer el diseño original.",
        "image":"personal-website.png",
        "url":"https://github.com/pa-suarezm/Personal-Website-in-React"
      },
      {
        "title":"Secret Santa",
        "category":"Aplicación en Java para asignarle a miembros de una familia una pareja para jugar Amigo Secreto y notificar por correo electrónico.",
        "image":"secret-santa.png",
        "url":"https://github.com/pa-suarezm/SecretSanta.git"
      }
    ],
    "projectsEn": [
      {
        "title": "BuffZ and NerfZ",
        "category": "Twin-stick arcade zombie shooter made in Unity, soon to be available on Steam and the Google Play Store. Every couple of seconds either the player or their enemies get buffed or nerfed.",
        "image": "buffz-and-nerfz.png",
        "url": "https://pa-suarezm.itch.io/buffz-and-nerfz"
      },
      {
        "title": "Asteroids",
        "category": "Hypercasual arcade game made in Unity, now available on the Google Play Store! The player controls their ship by tilting their phone and shoots by tapping the screen.",
        "image": "asteroids.png",
        "url": "https://play.google.com/store/apps/details?id=com.pulguita_games.asteroids"
      },
      {
        "title": "Papumba",
        "category": "App for iOS and Android made in Unity in which children between ages 2 and 7 can enjoy dozens of games, books, videos, and more while always learning something new.",
        "image": "papumba.png",
        "url": "https://www.papumba.com/"
      },
      {
        "title": "Feat",
        "category": "Website that connects food establishments with distributors and brand organizations, and enables establishments to order products to distributors and to manage their personnel",
        "image": "feat.png",
        "url": "https://www.instagram.com/feat.b4b/"
      },
      {
        "title":"Consultation Simulator",
        "category":"Serious game made so that medicine students could practice consultations with virtual patients programmed by their teachers.",
        "image":"simulador-de-consultas.png",
        "url":"https://youtu.be/3C3CkQcVXH0"
      },
      {
        "title":"Boom Away",
        "category":"Graduation project. We made a videogame in Unity using Agile Software Development techniques.",
        "image":"boom-away.png",
        "url":"https://boomawayinc.itch.io/"
      },
      {
        "title":"Easy Demographics",
        "category":"Mid-career project. Our team used AI to give users statistics regarding people visible in a given video.",
        "image":"easy-demographics.png",
        "url":"https://github.com/AfLosada/EasyDemographics"
      },
      {
        "title": "LUCI",
        "category": "Native Android app connected to Firebase. It was made to provide support for the registration and delivery of products sold at the Codabas market.",
        "image": "luci.png",
        "url": "https://gitlab.com/ISIS3510_202010_Team19/android-kotlin"
      },
      {
        "title":"Limbs",
        "category":"The first videogame I developed. It was my submission to the GTMK Game Jam 2019 with a development time of under 48 hours.",
        "image":"limbs.png",
        "url":"https://pa-suarezm.itch.io/limbs"
      },
      {
        "title":"Personal Website",
        "category":"Website made using React. I took the templated designed by Tim Baker and adjusted the code as I saw fit without compromising the original design.",
        "image":"personal-website.png",
        "url":"https://github.com/pa-suarezm/Personal-Website-in-React"
      },
      {
        "title":"Secret Santa",
        "category":"Java desktop application made for a game of Secret Santa in order to assign and notify the pairs via e-mail.",
        "image":"secret-santa.png",
        "url":"https://github.com/pa-suarezm/SecretSanta.git"
      }
    ]
  }
}
